[
  {
    "title": "CA Foundation Exam in One Month — What You Must Do",
    "desc": "If you're a CA Foundation student with only one month left...",
    "date": "January 2026",
    "url": "/Blog/Essential-Things-You-Must-Keep-in-Mind.html",
    "keywords": "ca foundation exam one month preparation strategy",
    "featured": true,
    "readTime": 6
  },
  {
    "title": "The 'Bas Kal Se Serious' Loop",
    "desc": "Why students keep postponing serious CA Foundation preparation and how this silent loop destroys consistency.",
    "date": "February 2026",
    "url": "/Blog/bas-kal-se-padhunga-system.html",
    "keywords": "bas kal se serious student psychology procrastination ca foundation",
    "featured": false,
    "readTime": 8
  },
  {
    "title": "The Burnout Feeling Before Exam",
    "desc": "Feeling mentally exhausted right before CA Foundation? This is what burnout actually looks like and why it happens.",
    "date": "February 2026",
    "url": "/Blog/burnout-feeling-before-exam.html",
    "keywords": "ca foundation burnout before exam mental fatigue students",
    "featured": true,
    "readTime": 7
  },
  {
    "title": "Is Coaching Mandatory for CA Foundation?",
    "desc": "Do you really need coaching to clear CA Foundation or is self-study enough? The reality most students miss.",
    "date": "February 2026",
    "url": "/Blog/coaching-is-mandatory.html",
    "keywords": "is coaching necessary for ca foundation self study vs coaching",
    "featured": false,
    "readTime": 9
  },
  {
    "title": "Don't Skip Anything — Is It Really True?",
    "desc": "The famous CA Foundation advice sounds safe, but does equal coverage actually help in the exam hall?",
    "date": "February 2026",
    "url": "/Blog/dont-skip-anything.html",
    "keywords": "should you skip chapters ca foundation smart prioritization",
    "featured": false,
    "readTime": 7
  },
  {
    "title": "Are Mock Tests Overrated?",
    "desc": "Mock tests are powerful — but only when used correctly. Most CA students use them the wrong way.",
    "date": "February 2026",
    "url": "/Blog/mock-test-overrated.html",
    "keywords": "are mock tests important ca foundation mock test strategy",
    "featured": true,
    "readTime": 8
  },
  {
    "title": "My Teacher Was Wrong About CA Foundation",
    "desc": "A brutally honest confession about blind faith in teacher strategies and the reality check that followed.",
    "date": "January 2026",
    "url": "/Blog/my-teacher-was-wrong-ca-foundation.html",
    "keywords": "teacher strategy wrong ca foundation failure story",
    "featured": false,
    "readTime": 12
  },
  {
    "title": "Why Watching Too Many Strategy Videos Hurts",
    "desc": "Strategy videos feel productive, but they often create the illusion of progress without real preparation.",
    "date": "February 2026",
    "url": "/Blog/watching-too-much-strategy-videos-hurts.html",
    "keywords": "too many study strategy videos productivity illusion ca students",
    "featured": false,
    "readTime": 6
  },
  {
    "title": "Why Your Brain Feels Heavy Even When You Slept Well",
    "desc": "Good sleep but still mentally tired? Understand cognitive fatigue during CA Foundation preparation.",
    "date": "February 2026",
    "url": "/Blog/why-brain-feels-heavy-even-when-you-slept-well.html",
    "keywords": "brain feels heavy after sleep cognitive fatigue ca students",
    "featured": false,
    "readTime": 7
  }
]